<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

use DB;

class ShopSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table("shops")->insert(
            [
                [
                    'name' => 'Курск "Батарейка" Моковская',
                    'city' => "Курск",
                    'adress' => "ул. Моковская, 17",
                    'geo' => "51.70980027557951,36.1507363544921",
                    'time_work' => "Пн.-Пт. 9:00-19:00 , Сб.-Вс. 10:00-16:00",
                    'img' => "kursk_mokovskaya.jpg",
                    'phone' => "+7(4712)35-44-25",
                    'aproved' => true
                ],

                [
                    'name' => 'Курск "Батарейка" 50летОктября',
                    'city' => "Курск",
                    'adress' => "ул. 50 лет Октября, 126",
                    'geo' => "51.76258115370133,36.130402771827704",
                    'time_work' => "",
                    'img' => "kursk_50let.jpg",
                    'phone' => "+7(4712)52-55-95",
                    'aproved' => true
                ],

                [
                    'name' => 'Курск "Батарейка" Стрела',
                    'city' => "Курск",
                    'adress' => "ул. Радищева, 118, магазин «Стрела»",
                    'geo' => "51.751230, 36.189727",
                    'time_work' => "",
                    'img' => "kursk_strela.jpg",
                    'phone' => "+7(4712)53-45-45",
                    'aproved' => true
                ],

                [
                    'name' => 'Железногорск "Батарейка"',
                    'city' => "Курск",
                    'adress' => "ул. Радищева, 118, магазин «Стрела»",
                    'geo' => "52.349420, 35.353854",
                    'time_work' => "",
                    'img' => "",
                    'phone' => "+7(910)211-01-70",
                    'aproved' => true
                ],

                [
                    'name' => 'Курск "Батарейка" Малых',
                    'city' => "Курск",
                    'adress' => "Курск, Малых, 33",
                    'geo' => "51.717831, 36.198495",
                    'time_work' => "Пн - Пт - с 09-00 до 19-00; Сб с 9-00 до 17-00; Вс - выходной",
                    'img' => "kursk_malyh.jpg",
                    'phone' => "+7(4712)50-31-04",
                    'aproved' => true
                ],

                [
                    'name' => 'Льгов "Батарейка"',
                    'city' => "Курск",
                    'adress' => "Льгов, 3-й Пятницкий переулок д.1А",
                    'geo' => "51.694284, 35.282734",
                    'time_work' => "",
                    'img' => "kursk_lgov.jpg",
                    'phone' => "+7(909)239-39-65",
                    'aproved' => true
                ],

                [
                    'name' => 'Рыльск "Батарейка" Советская площадь',
                    'city' => "Курск",
                    'adress' => "Рыльск, Советская площадь 7",
                    'geo' => "51.571946, 34.687879",
                    'time_work' => "",
                    'img' => "kursk_rilsk.jpg",
                    'phone' => "+7(951)089-36-46",
                    'aproved' => true
                ],

                [
                    'name' => 'Курск "Аккумуляторный Мир" 50летОктября (Партнерский магазин)',
                    'city' => "Курск",
                    'adress' => "Курск, 50 лет Октября, 126/3",
                    'geo' => "51.761722, 36.131418",
                    'time_work' => "",
                    'img' => "",
                    'phone' => "+7(904)522-86-63",
                    'aproved' => true
                ],

                [
                    'name' => 'Курск "Аккумуляторный Мир" Литовская (Партнерский магазин)',
                    'city' => "Курск",
                    'adress' => "Курск, Литовская, 12/2",
                    'geo' => "51.705191, 36.173207",
                    'time_work' => "",
                    'img' => "",
                    'phone' => "+7(951)331-88-55",
                    'aproved' => true
                ],

                [
                    'name' => 'Курск "Аккумуляторный Мир" Сумская',
                    'city' => "Курск",
                    'adress' => "Курск, г.Курск ул.Сумская 140 "А"",
                    'geo' => "51.712412, 36.125884",
                    'time_work' => "Пн - Пт 10:00-18:00 Сб -Вс 10:00-17:00",
                    'img' => "kursk_sumskaya.jpg",
                    'phone' => "+7(4712)220-540",
                    'aproved' => true
                ],

                [
                    'name' => 'Курск "Батарейка" Дериглазова',
                    'city' => "Курск",
                    'adress' => "Курск, Пр-кт Дериглазова 17 Г",
                    'geo' => "51.802703, 36.163505",
                    'time_work' => "C 09 До 19-00 без переывов и выходных",
                    'img' => "kursk_dereglazovo.jpg",
                    'phone' => "+7(904)523-18-16, +7(906)692-32-31",
                    'aproved' => true
                ],

                [
                    'name' => 'Белгород "Батарейка"',
                    'city' => "Белгород",
                    'adress' => "Белгород, ул. Корочанская, 132 А",
                    'geo' => "50.590376, 36.626362",
                    'time_work' => "",
                    'img' => "belgorod_korochanskaya.jpg",
                    'phone' => "+7(4722)21-34-12, моб. +7(920)585-55-55",
                    'aproved' => true
                ],

                [
                    'name' => 'Алексеевка "Батарейка"',
                    'city' => "Белгород",
                    'adress' => "Белгородская область, г. Алексеевка, ул. Комсомольская, 58 Б",
                    'geo' => "50.629298, 38.661307",
                    'time_work' => "",
                    'img' => "belgorod_korochanskaya.jpg",
                    'phone' => "+7(920)203-77-55",
                    'aproved' => true
                ],

                [
                    'name' => 'Борисовка "Батарейка"',
                    'city' => "Белгород",
                    'adress' => "Белгородская область, п. Борисовка, ул.Советская 9г",
                    'geo' => "50.605465, 36.010702",
                    'time_work' => "",
                    'img' => "belgorod_borisovka.jpg",
                    'phone' => "+7(961)175-45-55",
                    'aproved' => true
                ],

                [
                    'name' => 'Брянск "Батарейка" Нахимова',
                    'city' => "Брянск",
                    'adress' => "Брянск, ул. Нахимова д.112 (2 этаж)",
                    'geo' => "53.324363, 34.282487",
                    'time_work' => "",
                    'img' => "bryansk_nahimova.jpg",
                    'phone' => "+7(4832)300-356, +7(920)600-31-31",
                    'aproved' => true
                ],

                [
                    'name' => 'Брянск "Батарейка" Красный маяк',
                    'city' => "Брянск",
                    'adress' => "Брянск, ул. Красный маяк, д.1 (вход с торца здания)",
                    'geo' => "53.263700, 34.417639",
                    'time_work' => "",
                    'img' => "bryansk_mayak.jpg",
                    'phone' => "+7(4832)300-365, +7(930)820-03-65",
                    'aproved' => true
                ],

                [
                    'name' => 'Брянск "Батарейка" Костычева',
                    'city' => "Брянск",
                    'adress' => "Брянск, ул. Костычева д.72",
                    'geo' => "53.263985, 34.331706",
                    'time_work' => "9:00 - 19:00",
                    'img' => "bryansk_kosticheva.jpg",
                    'phone' => "+7(920)605-94-13",
                    'aproved' => true
                ],

                [
                    'name' => 'Брянск "Батарейка" Первомайская',
                    'city' => "Брянск",
                    'adress' => "Брянск, Карачевский р-н, г. Карачев ул. Первомайская д. 6А",
                    'geo' => "53.116681, 34.968441",
                    'time_work' => "9:00 - 18:00",
                    'img' => "bryansk_pervomayskaya.jpg",
                    'phone' => "+7(920)603-68-40",
                    'aproved' => true
                ],

                [
                    'name' => 'Брянск "Батарейка" Станке Димитрова',
                    'city' => "Брянск",
                    'adress' => "Брянск, ул. Станке Димитрова 45",
                    'geo' => "53.235855, 34.327780",
                    'time_work' => "Пн-Пт. 8:30-19:00, Сб 9:00-18:00, Вс 10:00-17:00",
                    'img' => "bryansk_dimitrova.jpg",
                    'phone' => "+7(950)690-42-72",
                    'aproved' => true
                ],

                [
                    'name' => 'Воронеж "Батарейка" Антонова-Овсеенко',
                    'city' => "Воронеж",
                    'adress' => "Воронеж, ул. Антонова-Овсеенко, 7Б/2",
                    'geo' => "51.696288, 39.130129",
                    'time_work' => "",
                    'img' => "voronesh_ovseeko.jpg",
                    'phone' => "+7(4732)20-46-99",
                    'aproved' => true
                ],

                [
                    'name' => 'Воронеж "Батарейка" Каменка',
                    'city' => "Воронеж",
                    'adress' => "Воронежская область, р.п. Каменка , ул. Гагарина, 26 А",
                    'geo' => "50.715388, 39.409999",
                    'time_work' => "",
                    'img' => "",
                    'phone' => "+7(47357)5-22-48",
                    'aproved' => true
                ],

                [
                    'name' => 'Острогожск "Батарейка" Кирова',
                    'city' => "Воронеж",
                    'adress' => "Воронежская область, г. Острогожск, ул. Кирова 110",
                    'geo' => "50.855881, 39.053772",
                    'time_work' => "",
                    'img' => "voronesh_kirova.jpg",
                    'phone' => "+7(952)102-72-29",
                    'aproved' => true
                ],

                [
                    'name' => 'Ливны "Батарейка"',
                    'city' => "Орел",
                    'adress' => "г. Ливны, ул. Железнодорожная, 14",
                    'geo' => "52.420096, 37.576627",
                    'time_work' => "",
                    'img' => "orel_livni.jpg",
                    'phone' => "+7(953)470-65-24",
                    'aproved' => true
                ],

                [
                    'name' => 'Смоленск "Батарейка" 25 Сентября',
                    'city' => "Смоленск",
                    'adress' => "Смоленск, ул.25 сентября д.20",
                    'geo' => "54.766459, 32.068948",
                    'time_work' => "Пн - Пт 09:00-19:00; Сб 10:00-15:00; Вс 10:00-15:00",
                    'img' => "smolensk_25.jpg",
                    'phone' => "+7(953)609-06-89",
                    'aproved' => true
                ],

                [
                    'name' => 'Рославль "Батарейка" Карла Маркса',
                    'city' => "Смоленск",
                    'adress' => "Рославль, ул.Карла Маркса д.51",
                    'geo' => "53.949572, 32.878636",
                    'time_work' => "Пн - Пт 09:00- 18:00 Сб - Вс 10:00- 16:00",
                    'img' => "smolensk_roslavl`.jpg",
                    'phone' => "+7(4813)46-57-77, +7(919)046-57-77",
                    'aproved' => true
                ],

                [
                    'name' => 'Смоленск "Батарейка" маршала Ерёменко',
                    'city' => "Смоленск",
                    'adress' => "Смоленск, Маршала Ерёменко 39 Автобаня Север",
                    'geo' => "54.813469, 32.010854",
                    'time_work' => "Пн - Пт 10:00 - 19:00; Сб 10:00 - 15:00",
                    'img' => "smolensk_eremenko.jpg",
                    'phone' => "+7(910)785-02-17",
                    'aproved' => true
                ],

                [
                    'name' => 'Смоленск Батарейка Ново-Московская 23',
                    'city' => "Смоленск",
                    'adress' => "Смоленск, ул. Ново-Московская д. 23",
                    'geo' => "54.813469, 32.010854",
                    'time_work' => "Пн - Пт 09:00 - 18:00; Сб 10:00 - 14:00",
                    'img' => "smolensk_novomoskovskaya.jpg",
                    'phone' => "+7(999)609-00-90",
                    'aproved' => true
                ],

                [
                    'name' => 'Тамбов "Батарейка" Гастелло (Авторынок)',
                    'city' => "Тамбов",
                    'adress' => "Тамбов, ул. Гастелло, 1",
                    'geo' => "52.720455, 41.424336",
                    'time_work' => "Вт.-Вс. 9:00-17:00",
                    'img' => "tambov_gastello.jpg",
                    'phone' => "+7(915)861-74-41",
                    'aproved' => true
                ],

                [
                    'name' => 'Тамбов магазин в Автолинии на Мичуринской',
                    'city' => "Тамбов",
                    'adress' => "Тамбов, г.Тамбов, улица Мичуринская 136/3",
                    'geo' => "52.760970, 41.400683",
                    'time_work' => "Ежедневно, 08:00–22:00",
                    'img' => "tambov_michurinkaya.jpg",
                    'phone' => "+7(4752)49-39-49",
                    'aproved' => true
                ],

                [
                    'name' => 'Мичуринск "Аккумуляторный Мир"',
                    'city' => "Тамбов",
                    'adress' => "Мичуринск, ул.Лаврова дом 16",
                    'geo' => "52.894999, 40.493304",
                    'time_work' => "Вт. - Сб. 9:00 - 17:00, Вс 9:00 - 16:00, Пн - выходной",
                    'img' => "tambov_akkumulyatorniymir.jpg",
                    'phone' => "+7(915)678-07-07",
                    'aproved' => true
                ],

                [
                    'name' => 'Тамбов "Батарейка" Пролетарская 2 "з"',
                    'city' => "Тамбов",
                    'adress' => "Тамбов, г. Тамбов ул. Пролетарская 2 з",
                    'geo' => "52.702026, 41.461598",
                    'time_work' => "Ежедневно, 8-20 Без выходных",
                    'img' => "tambov_proletarskya.jpg",
                    'phone' => "+7(4752)76-01-53",
                    'aproved' => true
                ],

                [
                    'name' => 'Тамбов "Батарейка" Мичуринская',
                    'city' => "Тамбов",
                    'adress' => "Тамбов, г. Тамбов ул. Мичуринская дом 98",
                    'geo' => "52.744749, 41.424354",
                    'time_work' => "Пн-Сб 09:00-17:45, Вс - выходной",
                    'img' => "tambov_michurinskaya.jpg",
                    'phone' => "+7(929)019-19-00",
                    'aproved' => true
                ],

                [
                    'name' => 'Тула "Батарейка"',
                    'city' => "Тула",
                    'adress' => "Тула, ул. Рязанская, 3 И",
                    'geo' => "54.158182, 37.601762",
                    'time_work' => "",
                    'img' => "tula_battary.jpg.jpg",
                    'phone' => "+7(4872)70-93-61",
                    'aproved' => true
                ],

                [
                    'name' => 'Богородицк «Батарейка»',
                    'city' => "Тула",
                    'adress' => "Тульская область, г. Богородицк , ул. Коммунаров, 84 А",
                    'geo' => "53.777851, 38.131813",
                    'time_work' => "",
                    'img' => "",
                    'phone' => "+7(4876)7-12-93",
                    'aproved' => true
                ],
            ]
        );
    }
}
